Repository: AnQE180187/Perfume-Sales
Catalog: mobile/lib/l10n/app_*.arb
Languages: vi

source: ATELIER DE PARFUM
vi: XƯỞNG NƯỚC HOA

source: Welcome Back
vi: Chào mừng trở lại

source: EMAIL ADDRESS
vi: ĐỊA CHỈ EMAIL

source: PASSWORD
vi: MẬT KHẨU

source: FORGOT PASSWORD?
vi: QUÊN MẬT KHẨU?

source: LOGIN
vi: ĐĂNG NHẬP

# dontHaveAccount
source: DON'T HAVE AN ACCOUNT?
vi: BẠN CHƯA CÓ TÀI KHOẢN?

source: CREATE ACCOUNT
vi: TẠO TÀI KHOẢN

source: OR
vi: HOẶC

source: Join the Atelier
vi: Gia nhập Xưởng

source: FULL NAME
vi: HỌ VÀ TÊN

source: PHONE (OPTIONAL)
vi: SỐ ĐIỆN THOẠI (KHÔNG BẮT BUỘC)

# agreeToTerms
source: I AGREE TO THE TERMS AND PRIVACY POLICY
vi: TÔI ĐỒNG Ý VỚI ĐIỀU KHOẢN VÀ CHÍNH SÁCH BẢO MẬT

# registrationSuccessful
source: REGISTRATION SUCCESSFUL. PLEASE VERIFY YOUR EMAIL.
vi: ĐĂNG KÝ THÀNH CÔNG. VUI LÒNG XÁC THỰC EMAIL.

# pleaseFillFields
source: PLEASE FILL IN ALL REQUIRED FIELDS
vi: VUI LÒNG ĐIỀN ĐỦ THÔNG TIN

# pleaseAcceptTerms
source: PLEASE ACCEPT THE TERMS & CONDITIONS
vi: VUI LÒNG CHẤP NHẬN ĐIỀU KHOẢN

source: ACCESS DENIED
vi: TRUY CẬP BỊ TỪ CHỐI

source: PLEASE PROVIDE CREDENTIALS
vi: VUI LÒNG CUNG CẤP THÔNG TIN

# dnaScent
source: CREATE YOUR DNA SCENT
vi: TẠO MÙI HƯƠNG DNA CỦA BẠN

# onboarding1Title
source: THE ART OF SCENT
vi: NGHỆ THUẬT MÙI HƯƠNG

# onboarding1Subtitle
source: Discover your unique fragrance identity through our AI-curated collection.
vi: Khám phá bản sắc nước hoa độc bản của bạn thông qua bộ sưu tập do AI tuyển chọn.

# onboarding2Title
source: NEURAL CURATION
vi: TUYỂN CHỌN THẦN KINH

# onboarding2Subtitle
source: Our AI analyzes thousands of scent notes to find your perfect match.
vi: AI của chúng tôi phân tích hàng ngàn nốt hương để tìm ra sự kết hợp hoàn hảo cho bạn.

# onboarding3Title
source: TIMELESS LUXURY
vi: SỰ SANG TRỌNG VĨNH CỬU

# onboarding3Subtitle
source: Experience the future of fragrance, crafted with traditional excellence.
vi: Trải nghiệm tương lai của nước hoa, được chế tác với sự xuất sắc truyền thống.

source: NEXT
vi: TIẾP THEO

# beginJourney
source: BEGIN THE JOURNEY
vi: BẮT ĐẦU HÀNH TRÌNH

source: NEURAL ARCHITECT
vi: KIẾN TRÚC SƯ THẦN KINH

# describeVision
source: DESCRIBE YOUR VISION...
vi: MÔ TẢ Ý TƯỞNG CỦA BẠN...

# welcomeMessage
source: Welcome to the Atelier. I am your Neural Architect. Tell me, what emotional landscape do you wish to explore through scent today?
vi: Chào mừng bạn đến với Xưởng. Tôi là Kiến trúc sư Thần kinh của bạn. Hãy cho tôi biết, bạn muốn khám phá bối cảnh cảm xúc nào thông qua mùi hương hôm nay?

source: YOUR PROFILE
vi: HỒ SƠ CỦA BẠN

source: ATELIER MEMBER
vi: THÀNH VIÊN XƯỞNG

source: THE ATELIER
vi: XƯỞNG SÁNG TÁC

source: ACQUISITION HISTORY
vi: LỊCH SỬ SỞ HỮU

source: CURATED COLLECTION
vi: BỘ SƯU TẬP TUYỂN CHỌN

source: NEURAL DNA ARCHIVE
vi: KHO LƯU TRỮ DNA THẦN KINH

source: SYSTEM
vi: HỆ THỐNG

source: APPEARANCE
vi: GIAO DIỆN

source: LANGUAGE
vi: NGÔN NGỮ

source: CONCIERGE
vi: DỊCH VỤ HỖ TRỢ

source: DISCONNECT SESSION
vi: ĐĂNG XUẤT

source: LUMINA ATELIER
vi: XƯỞNG LUMINA

source: INTENSITY
vi: ĐỘ ĐẬM ĐẶC

source: NEURAL INSIGHT
vi: THÔNG TIN THẦN KINH

source: SCENT PROFILE
vi: CẤU TRÚC MÙI HƯƠNG

source: THE STORY
vi: CÂU CHUYỆN

source: ACQUIRE SCENT
vi: SỞ HỮU MÙI HƯƠNG

# topNotes
source: TOP
vi: HƯƠNG ĐẦU

# heartNotes
source: HEART
vi: HƯƠNG GIỮA

# baseNotes
source: BASE
vi: HƯƠNG CUỐI

source: ORDER ATELIER
vi: XÁC NHẬN ĐƠN HÀNG

source: YOUR SELECTION
vi: LỰA CHỌN CỦA BẠN

source: SHIPPING ATELIER
vi: GIAO HÀNG

source: CHANGE
vi: THAY ĐỔI

source: Payment Method
vi: Phương thức thanh toán

source: SUBTOTAL
vi: TỔNG TIỀN HÀNG

source: PRIORITY SHIPPING
vi: GIAO HÀNG ƯU TIÊN

source: COMPLIMENTARY
vi: MIỄN PHÍ

source: TOTAL ACQUISITION
vi: TỔNG THANH TOÁN

source: CONFIRM ORDER
vi: XÁC NHẬN ĐẶT HÀNG

source: ACQUISITION COMPLETE
vi: SỞ HỮU THÀNH CÔNG

# orderCodified
source: Your molecular signature has been codified. Your fragrance is being prepared.
vi: Mã định danh phân tử của bạn đã được mã hóa. Mùi hương của bạn đang được chuẩn bị.

source: TRACE ORDER
vi: THEO DÕI ĐƠN HÀNG

source: RETURN TO ATELIER
vi: QUAY LẠI XƯỞNG

source: SHOPPING CART
vi: GIỎ HÀNG

# yourCartEmpty
source: YOUR CART IS EMPTY
vi: GIỎ HÀNG TRỐNG

# discoverCollection
source: Discover our curated collection
vi: Khám phá bộ sưu tập tuyển chọn

source: EXPLORE COLLECTION
vi: KHÁM PHÁ BỘ SƯU TẬP

source: PROMO CODE
vi: MÃ KHUYẾN MÃI

source: APPLY
vi: ÁP DỤNG

source: Discount
vi: Giảm giá

source: TOTAL
vi: TỔNG CỘNG

# proceedCheckout
source: PROCEED TO CHECKOUT
vi: TIẾN HÀNH THANH TOÁN

source: discount applied
vi: giảm giá đã áp dụng

source: Invalid promo code
vi: Mã khuyến mãi không hợp lệ

source: ORDER HISTORY
vi: LỊCH SỬ ĐƠN HÀNG

source: NO ORDERS YET
vi: CHƯA CÓ ĐƠN HÀNG

# orderHistoryAppear
source: Your order history will appear here
vi: Lịch sử đơn hàng sẽ xuất hiện tại đây

source: START SHOPPING
vi: BẮT ĐẦU MUA SẮM

source: ORDER DETAILS
vi: CHI TIẾT ĐƠN HÀNG

source: ORDER NUMBER
vi: MÃ ĐƠN HÀNG

source: ORDER DATE
vi: NGÀY ĐẶT HÀNG

source: ORDER TIMELINE
vi: TIẾN TRÌNH ĐƠN HÀNG

source: TRACKING INFORMATION
vi: THÔNG TIN VẬN CHUYỂN

source: Tracking Number
vi: Mã vận đơn

source: TRACK SHIPMENT
vi: THEO DÕI VẬN CHUYỂN

source: ITEMS
vi: SẢN PHẨM

source: SHIPPING ADDRESS
vi: ĐỊA CHỈ GIAO HÀNG

source: Shipping Fee
vi: Phí vận chuyển

source: FREE
vi: MIỄN PHÍ

source: REORDER
vi: ĐẶT LẠI

source: CANCEL ORDER
vi: HỦY ĐƠN HÀNG

# cancelOrderConfirm
source: Are you sure you want to cancel this order?
vi: Bạn có chắc muốn hủy đơn hàng này?

source: NO
vi: KHÔNG

# yesCancelOrder
source: YES, CANCEL
vi: CÓ, HỦY ĐƠN

source: Order cancelled
vi: Đơn hàng đã hủy

# orderPlacedSuccess
source: Order placed successfully
vi: Đặt hàng thành công

source: Failed to reorder
vi: Đặt lại thất bại

source: Failed to cancel
vi: Hủy đơn thất bại

# failedLoadOrders
source: Failed to load orders
vi: Tải đơn hàng thất bại

# failedLoadOrder
source: Failed to load order
vi: Tải chi tiết đơn hàng thất bại

source: RETRY
vi: THỬ LẠI

source: more items
vi: sản phẩm khác

source: Qty
vi: SL

source: Order number copied
vi: Đã sao chép mã đơn hàng

# orderStatusPending
source: Pending
vi: Chờ xử lý

# orderStatusConfirmed
source: Confirmed
vi: Đã xác nhận

# orderStatusProcessing
source: Processing
vi: Đang xử lý

# orderStatusShipped
source: Shipped
vi: Đã giao vận

# orderStatusOutForDelivery
source: Out for Delivery
vi: Đang giao hàng

# orderStatusDelivered
source: Delivered
vi: Đã giao hàng

# orderStatusCancelled
source: Cancelled
vi: Đã hủy

# orderStatusRefunded
source: Refunded
vi: Đã hoàn tiền

# orderDescPending
source: Your order is being processed
vi: Đơn hàng đang được xử lý

# orderDescConfirmed
source: Order confirmed and preparing
vi: Đơn hàng đã xác nhận và đang chuẩn bị

# orderDescProcessing
source: Packaging your fragrance
vi: Đang đóng gói mùi hương của bạn

# orderDescShipped
source: On the way to you
vi: Đang trên đường đến bạn

# orderDescOutForDelivery
source: Arriving today
vi: Sẽ giao hôm nay

# orderDescDelivered
source: Successfully delivered
vi: Giao hàng thành công

# orderDescCancelled
source: Order cancelled
vi: Đơn hàng đã hủy

# orderDescRefunded
source: Refund processed
vi: Đã hoàn tiền

source: PAYMENT
vi: THANH TOÁN

source: SELECT PAYMENT METHOD
vi: CHỌN PHƯƠNG THỨC THANH TOÁN

# cod
source: Cash on Delivery
vi: Thanh toán khi nhận hàng

source: PAY NOW
vi: THANH TOÁN NGAY

source: Processing payment...
vi: Đang xử lý thanh toán...

# paymentSuccess
source: Payment successful
vi: Thanh toán thành công

source: Payment failed
vi: Thanh toán thất bại

source: Payment cancelled
vi: Đã hủy thanh toán
